banks = ["Сбербанк","Тинькофф","Альфа-Банк","ВТБ", "ПСБ"]

bin_codes = {
    "Сбербанк": ["27402", "27406", "27411", "27416", "27417", "27418", "27420", "27422", "27425", "27427"],
    "Альфа-Банк": ["10584", "15400", "15428", "15429", "15481", "15482", "19539", "19540", "21118", "27714"],
    "Тинькофф": ["41361", "42721", "41271", "44272", "28273", "28974", "28973", "28972", "28890", "28321"],
    "ВТБ": ["18868", "18869", "18870", "18873", "21191", "26375", "30127", "31723", "40622", "40623"],
    "ПСБ": ["02507", "04906", "24561", "24562", "24563", "26803", "26804", "29726", "29727", "29728"],
}

payment_systems = ["МИР", "Visa", "MasterCard"]

payment_systems_codes = {
    "МИР": "2",
    "Visa": "4",
    "MasterCard": "5"
}

stores= [ "М.Видео", "Эльдорадо", "DNS", "OZON", "Wildberries", "Лента", "Пятёрочка", "Ашан", "Metro", "OКей", "Перекрёсток", 
"Дикси", "Магнит", "FixPrice", "Золотое Яблоко", "Азбука Вкуса", "Hoff", "OBI", "Леруа Мерлен", "H&M",  "Zara", "Спортмастер"]

stores_data = {
    'М.Видео': [
        [59.920141, 30.322005, '10:00', '12:00'], 
        [59.882592, 30.324724, '10:00', '22:00'], 
        [59.874621, 30.369119, '09:00', '21:00']
    ],
    
    "Эльдорадо": [
        [59.941058, 30.294824, "10:00", "20:00"],
        [59.877354, 30.358700, "09:00", "21:00"],
        [59.870246, 30.379192, "10:00", "22:00"]
    ],
    "DNS": [
        [59.875571, 30.368339, "10:00", "22:00"],
        [59.914613, 30.318043, "09:00", "20:00"],
        [59.845385, 30.323386, "10:00", "22:00"]
    ],
    "OZON": [
        [59.955543, 30.303456, "10:00", "22:00"],
        [59.902312, 30.301234, "10:00", "23:00"],
        [59.941234, 30.321567, "09:00", "20:00"]
    ],
    "Wildberries": [
        [59.937890, 30.315432, "10:00", "22:00"],
        [59.954321, 30.309876, "10:00", "21:00"],
        [59.923456, 30.306789, "11:00", "22:00"]
    ],
    "Лента": [
        [59.907884, 30.302755, "10:00", "22:00"],
        [59.919543, 30.346746, "09:00", "20:00"],
        [59.846614, 30.339085, "10:00", "22:00"]
    ],
    "Пятёрочка": [
        [59.856022, 30.345835, "10:00", "22:00"],
        [59.851500, 30.027123, "09:00", "21:00"],
        [59.932123, 30.307654, "10:00", "22:00"]
    ],
    "Ашан": [
        [59.913418, 30.340568, "09:00", "21:00"],
        [59.867865, 30.350961, "10:00", "22:00"],
        [59.816514, 30.317999, "10:00", "20:00"]
    ],
    "Metro": [
        [59.823101, 30.314534, "10:00", "22:00"],
        [59.944488, 30.455482, "11:00", "22:00"]
    ],
    "OКей": [
        [59.828255, 30.315247, "10:00", "22:00"],
        [59.914959, 30.479734, "10:00", "21:00"],
        [59.884972, 30.311267, "10:00", "22:00"]
    ],
    "Перекрёсток": [
        [59.863422, 30.404700, "10:00", "22:00"],
        [59.901915, 30.271429, "10:00", "21:00"],
        [59.958432, 30.411918, "09:00", "20:00"]
    ],
    "Дикси": [
        [59.924321, 30.318765, "10:00", "22:00"],
        [59.945678, 30.312345, "10:00", "21:00"],
        [59.926789, 30.308901, "10:00", "22:00"]
    ],
    "Магнит": [
        [59.926543, 30.323765, "10:00", "22:00"],
        [59.937890, 30.320456, "10:00", "20:00"],
        [59.941234, 30.314567, "10:00", "22:00"]
    ],
    "FixPrice": [
        [59.935432, 30.319876, "10:00", "22:00"],
        [59.915678, 30.311234, "09:00", "20:00"],
        [59.946789, 30.310123, "10:00", "22:00"]
    ],
    "Золотое Яблоко": [
        [59.943210, 30.315432, "10:00", "22:00"],
        [59.925123, 30.302345, "10:00", "21:00"],
        [59.911234, 30.316789, "09:00", "20:00"]
    ],
    "Азбука Вкуса": [
        [59.921678, 30.312345, "10:00", "22:00"],
        [59.934123, 30.317654, "10:00", "20:00"],
        [59.918765, 30.309876, "10:00", "22:00"]
    ],
    "Hoff": [
        [59.914567, 30.304321, "10:00", "22:00"],
        [59.926543, 30.320456, "10:00", "21:00"],
        [59.937890, 30.310765, "10:00", "22:00"]
    ],
    "OBI": [
        [59.874446, 30.348554, "10:00", "22:00"],
        [59.902220, 30.519794, "10:00", "20:00"],
        [59.996297, 30.146508, "10:00", "22:00"]
    ],
    "Леруа Мерлен": [
        [59.913456, 30.319987, "10:00", "22:00"],
        [59.926789, 30.312345, "10:00", "21:00"],
        [59.917654, 30.316543, "09:00", "20:00"]
    ],
    "H&M": [
        [59.927654, 30.312345, "10:00", "22:00"],
        [59.948765, 30.321456, "10:00", "21:00"],
        [59.934321, 30.308765, "10:00", "22:00"]
    ],
    "Zara": [
        [59.928123, 30.304567, "10:00", "22:00"],
        [59.945678, 30.315432, "10:00", "20:00"],
        [59.919876, 30.311234, "10:00", "22:00"]
    ],
    "Спортмастер": [
        [59.930123, 30.308765, "10:00", "22:00"],
        [59.945678, 30.315123, "10:00", "21:00"],
        [59.918765, 30.324567, "10:00", "22:00"]
    ]
}

categories = {
    "М.Видео": ["Смартфоны", "Ноутбуки", "Телевизоры", "Планшеты", "Наушники", "Микроволновые печи", "Стиральные машины"],
    "Эльдорадо": ["Смартфоны", "Ноутбуки", "Телевизоры", "Планшеты", "Умные часы", "Наушники", "Игровые приставки", "Блендеры"],
    "DNS": ["Смартфоны", "Ноутбуки", "Телевизоры", "Планшеты", "Кофеварки и кофемашины", "Кондиционеры", "Компьютерные кресла"],
    "OZON": ["Смартфоны", "Ноутбуки", "Телевизоры", "Кофеварки и кофемашины", "Холодильники", "Гироскутеры", "Наручные часы"],
    "Wildberries": ["Смартфоны", "Косметика", "Кофеварки и кофемашины", "Холодильники", "Микроволновые печи"],
    "Лента": ["Продукты", "Косметика", "Вентиляторы", "Гироскутеры", "Кроссовки", "Пылесосы", "Принтеры"],
    "Пятёрочка": ["Продукты", "Косметика", "Обогреватели"],
    "Ашан": ["Парфюмерия", "Холодильники", "Продукты"],
    "Metro": ["Продукты", "Косметика", "Гладильные доски", "Стулья для офиса"],
    "OКей": ["Продукты", "Косметика", "Сейфы"],
    "Перекрёсток": ["Продукты", "Косметика", "Настольные лампы"],
    "Дикси": ["Продукты", "Косметика", "Чайники"],
    "Магнит": ["Продукты", "Косметика", "Чайники"],
    "FixPrice": ["Продукты", "Косметика", "Фены"],
    "Золотое Яблоко": ["Парфюмерия", "Косметика", "Ароматы", "Сумки"],
    "Азбука Вкуса": ["Продукты"],
    "Hoff": ["Шкафы", "Столы", "Диваны", "Шкафы для одежды", "Кровати", "Кухонные столы"],
    "OBI": ["Газонокосилки", "Садовый инвентарь", "Инструменты", "Шкафы для одежды", "Комоды", "Кровати", "Игровые столы", "Камеры видеонаблюдения"],
    "Леруа Мерлен": ["Газонокосилки", "Садовый инвентарь", "Инструменты", "Шкафы для одежды", "Кровати", "Шкафы-купе"],
    "H&M": ["Одежда", "Обувь", "Кроссовки", "Пуховики", "Рубашки", "Платья"],
    "Zara": ["Одежда", "Обувь", "Кроссовки", "Пуховики", "Рубашки", "Джинсы"],
    "Спортмастер": ["Спортивная одежда", "Спортивный инвентарь", "Велосипеды", "Ролики", "Палатки", "Туристические рюкзаки", "Кроссовки", "Носки", "Куртки"]
}

brands = { 
    "Смартфоны": ["Huawei", "Samsung", "Apple", "Xiaomi", "OnePlus", "Realme", "Oppo", "Vivo", "Google", "Sony", 12000, 100000], 
    "Умные часы": ["Xiaomi", "Apple", "Samsung", "Garmin", "Amazfit", "Huawei", "Fitbit", "Withings", "Fossil", "Honor", 1000, 25000],
    "Наушники": ["Xiaomi", "Apple", "JBL", "Beats", "Bose", "Sony", "Sennheiser", "Jabra", "Skullcandy", "Anker", 4000, 30000],
    "Телевизоры": ["Samsung", "LG", "Xiaomi", "Sony", "Panasonic", "Philips", "Hisense", "TCL", "Sharp", "Vizio", 20000, 100000],
    "Ноутбуки": ["Apple", "Huawei", "Xiaomi", "Lenovo", "Samsung", "HP", "Asus", "Acer", "Dell", "Microsoft", 12000, 150000],
    "Холодильники": ["Samsung", "LG", "Nordfrost", "Бирюса", "Atlant", "Beko", "Bosch", "Gorenje", "Haier", "Indesit", 20000, 100000],
    "Микроволновые печи": ["Bosch", "Gorenje", "Maunfeld", "Midea", "Panasonic", "Samsung", "LG", "Sharp", "Daewoo", "Electrolux", 7000, 30000],
    "Кофеварки и кофемашины": ["TEENRA", "DeLonghi", "Bosch", "Philips", "Nespresso", "Krups", "Jura", "Gaggia", "Miele", "Saeco", 15000, 30000],
    "Вентиляторы": ["Centek", "Equation", "Scarlett", "Ballu", "Tefal", "Vitek", "Polaris", "SUPRA", "StarWind", "Dyson", 1500, 20000],
    "Кондиционеры": ["Haier", "Ballu", "Hisense", "ROYAL Clima", "Electrolux", "Mitsubishi", "Daikin", "Panasonic", "LG", "Toshiba", 20000, 40000],
    "Палатки": ["BTrace", "High Peak", "Tplus", "Talberg", "Alexika", "Marmot", "The North Face", "MSR", "Coleman", "Salewa", 7000, 50000],
    "Велосипеды": ["STELS", "Forward", "Novatrack", "Stark", "Stinger", "Merida", "Scott", "Trek", "Specialized", "Cannondale", 12000, 150000],
    "Гироскутеры": ["GT", "Hoverbot", "MiniPro", "Zaxboard", "Xiaomi", "Ninebot", "Smart Balance", "Razor", "Airwheel", "InMotion", 15000, 100000],
    "Газонокосилки": ["Huter", "PATRIOT", "Ресанта", "Зубр", "Champion", "Gardena", "Bosch", "Makita", "Stiga", "Honda", 15000, 60000],
    "Планшеты": ["Apple", "Huawei", "Xiaomi", "Lenovo", "Samsung", "BQ", "Microsoft", "Acer", "Asus", "Dell", 12000, 100000],
    "Парфюмерия": ["SHAIK", "Fragrance World", "Giorgio Armani", "Killian", "Dior", "Chanel", "Gucci", "Versace", "Tom Ford", "YSL", 300, 80000],
    "Наручные часы": ["Casio", "Traser", "Jacques Lemans", "Xiaomi", "Apple", "Seiko", "Citizen", "Omega", "Breitling", "Tissot", 200, 30000],
    "Сумки": ["Guess", "Michael Kors", "Chanel", "Louis Vuitton", "Prada", "Fendi", "Coach", 800, 20000],
    "Компьютерные кресла": ["DXRacer", "ThunderX3", "AeroCool", "Cougar", "Secretlab", "AKRacing", "Nitro Concepts", "Noblechairs", "Vertagear", "Anda Seat", 15000, 50000],
    "Туристические рюкзаки": ["Osprey", "Deuter", "The North Face", "Gregory", "Lowe Alpine", "Vaude", "Salomon", "Columbia", "Black Diamond", "Fjallraven", 7000, 20000],
    "Ролики": ["Rollerblade", "K2", "Powerslide", "Fila", "Seba", "Roces", "USD", "Bauer", "Bont", "Reign", 3000, 12000],
    "Продукты": ["Молоко", "Хлеб", "Яйца", "Мясо", "Овощи", "Фрукты", "Крупы", "Макароны", "Консервы", 200, 500],
    "Косметика": ["Лосьоны", "Кремы", "Шампуни", "Гели", 200, 3000],
    "Шкафы для одежды": ["Hoff", "Leroy Merlin", "Столплит", "Шатура", "Белфан", "Орматек", "Mebelvia", "Ангстрем", "Mr.Doors", 15000, 100000],
    "Комоды": ["Hoff", "Столплит", "Лазурит", "Mebelvia", "Белфан", "Ангстрем", "Шатура", "Mr.Doors", "Эстелла", 12000, 50000],
    "Кровати": ["Орматек", "Hoff", "Белфан", "Mebelvia", "Лазурит", "Столплит", "Шатура", "Ангстрем", "Mr.Doors", 25000, 200000],
    "Кухонные столы": ["Hoff", "Лазурит", "Столплит", "Белфан", "Mebelvia", "Шатура", "Ангстрем", "Mr.Doors", "Эстелла", 15000, 70000],
    "Диваны": ["Hoff", "Лазурит", "Anderssen", "Столплит", "Белфан", "Mebelvia", "Шатура", "Ангстрем", "Орматек", 35000, 150000],
    "Кроссовки": ["New Balance", "Reebok", "ASICS", "Salomon", "Saucony", "Hoka One One", "Mizuno", 3000, 50000],
    "Пуховики": ["Columbia", "Canada Goose", "The North Face", "Salomon", "Montbell", "Baon", 7000, 80000],
    "Рубашки": ["Henderson", "Hugo Boss", "Zara", "Massimo Dutti", "Levi's", "Tommy Hilfiger", 5000, 30000],
    "Джинсы": ["Levi's", "Wrangler", "Lee", "Diesel", "Tommy Hilfiger", "Colin's", 500, 3000],
    "Носки": ["Henderson", "Stance", "Puma", "Adidas", "Levi's", "Reebok", 500, 3000],
    "Куртки": ["Columbia", "The North Face", "Salomon", "Patagonia", "Jack Wolfskin", "Baon", 3000, 30000],
    "Платья": ["Mango", "Zarina", "Sela", "O\"STIN", "Befree", 1500, 20000],
    "Игровые приставки": ["Sony PlayStation", "Microsoft Xbox", "Nintendo", "Sega", 12000, 100000],
    "Стиральные машины": ["Samsung", "LG", "Indesit", "Bosch", "Haier", "Midea", "Electrolux", "Siemens", "Ariston", "Candy", 25000, 100000],
    "Блендеры": ["Braun", "Bosch", "Philips", "Vitek", "Scarlett", "Moulinex", "Redmond", "Tefal", "Polaris", "Bork", 1500, 18000],
    "Пылесосы": ["Dyson", "Xiaomi", "Bosch", "Philips", "Samsung", "Thomas", "LG", "Karcher", "Rowenta", "Electrolux", 6000, 20000],
    "Шкафы-купе": ["Hoff", "Лазурит", "Mr.Doors", "Столплит", "Mebelvia", "Шатура", "Орматек", "Белфан", 12000, 40000],
    "Игровые столы": ["DXRacer", "Cougar", "Aerocool", "ThunderX3", "Nitro Concepts", "Arozzi", "IKEA", 15000, 50000],
    "Гладильные доски": ["Nika", "Leifheit", "Hausmann", "Eurogold", "Philips", "Bosch", "Мещера", 2000, 10000],
    "Обогреватели": ["Ballu", "Electrolux", "Polaris", "Timberk", "De\"Longhi", "Hyundai", "Vitek", "Rolsen", 2000, 16000],
    "Чайники": ["Bosch", "Philips", "Tefal", "Vitek", "Redmond", "Xiaomi", "Scarlett", "Braun", "Bork", "Moulinex", 2000, 15000],
    "Фены": ["Philips", "Braun", "Dyson", "Remington", "Rowenta", "Babyliss", "Bosch", "Xiaomi", "Vitek", "Scarlett", 1500, 13000],
    "Ручные инструменты": ["Bosch", "Makita", "DeWalt", "Metabo", "Зубр", "Stanley", "Ryobi", "Black+Decker", 150, 40000],
    "Настольные лампы": ["Maytoni", "Lightstar", "ST-Luce", "Odeon Light", "Eglo", "Arte Lamp", "Lussole", "MW-Light", "Eurosvet", "Globo", 2000, 7000],
    "Стулья для офиса": ["Бюрократ", "TetChair", "Chairman", "Nowy Styl", "IKEA", "DUOREST", "Hara Chair", "Komfort Seating", "KAB Seating", 3000, 25000],
    "Сейфы": ["Aiko", "Valberg", "Safewell", "MDTB", "Juwel", "Stark", "Onix", "Burg-Wachter", "Technomax", 3000, 15000],
    "Принтеры": ["HP", "Canon", "Epson", "Brother", "Samsung", "Xerox", "Kyocera", "Ricoh", "OKI", 10000, 20000],
    "Камеры видеонаблюдения": ["Hikvision", "Dahua", "Xiaomi", "Axis", "Samsung", "TP-Link", "EZVIZ", "Uniview", "Bosch", 5000, 20000],
    "Шкафы": ["Hoff", "Столплит", "Мебельный Двор", "Лазурит", 15000, 50000],
    "Обувь": ["Adidas", "Puma", "Reebok", "New Balance", 2000, 18000],
    "Инструменты": ["Bosch", "Makita", "DeWalt", "Stanley", "Black+Decker", 200, 50000],
    "Одежда": ["Zara", "H&M", "Uniqlo", "Mango", "Bershka", 1000, 20000],
    "Спортивная одежда": ["Adidas", "Nike", "Under Armour", "Puma", "Reebok", 1000, 20000],
    "Спортивный инвентарь": ["Wilson", "Head", "Dunlop", "Babolat", "Kettler", 1000, 20000],
    "Столы": ["Hoff", "Столплит", "Мебельный Двор", "Лазурит", 7000, 20000],
    "Ароматы": ["Chanel", "Dior", "Gucci", "Hugo Boss", "Versace", 1000, 12000],
    "Садовый инвентарь": ["Gardena", "Fiskars", "Bosch", "Black+Decker", "AL-KO", 500, 10000],
    "Системы видеонаблюдения": ["Hikvision", "Dahua", "TP-Link", 10000, 100000]
}